### Create a Column Using For Loop

In [15]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3]})
df['B'] = [df['A'][i] * 2 for i in range(len(df))]
df

   A  B
0  1  2
1  2  4
2  3  6

### Get Column Names

In [16]:
column_names = df.columns.tolist()
column_names

['A', 'B']

###  Rename Columns

In [18]:
df.rename(columns={'A': 'Column_A', 'B': 'Column_B'}, inplace=True)
df

   Column_A  Column_B
0         1         2
1         2         4
2         3         6

### Collapse Multiple Columns

In [19]:
df['Combined'] = df['Column_A'].astype(str) + '_' + df['Column_B'].astype(str)
df

   Column_A  Column_B Combined
0         1         2      1_2
1         2         4      2_4
2         3         6      3_6

###  Get Unique Values from a Column

In [20]:
unique_values = df['Column_A'].unique()
unique_values

array([1, 2, 3], dtype=int64)

### Conditional Operation on Columns

In [21]:
df['New_Column'] = df['Column_A'].apply(lambda x: 'High' if x > 1 else 'Low')
df

   Column_A  Column_B Combined New_Column
0         1         2      1_2        Low
1         2         4      2_4       High
2         3         6      3_6       High

### Return Index Label Based on Condition

In [22]:
index_labels = df.index[df['Column_A'] > 1].tolist()
index_labels

[1, 2]

###  Remap Values Using Dictionary

In [23]:
df['Column_A'] = df['Column_A'].map({1: 'One', 2: 'Two', 3: 'Three'})
df

  Column_A  Column_B Combined New_Column
0      One         2      1_2        Low
1      Two         4      2_4       High
2    Three         6      3_6       High

### Format Integer Column

In [24]:
df['Formatted'] = df['Column_B'].apply(lambda x: f"{x:,.2f}")
df

  Column_A  Column_B Combined New_Column Formatted
0      One         2      1_2        Low      2.00
1      Two         4      2_4       High      4.00
2    Three         6      3_6       High      6.00

###  Split a Column

In [30]:
df[['First_Part', 'Second_Part']] = df['Combined'].str.split('_', expand=True)
df

  Column_A  Column_B Combined New_Column Formatted First_Part Second_Part
0      One         2      1_2        Low      2.00          1           2
1      Two         4      2_4       High      4.00          2           4
2    Three         6      3_6       High      6.00          3           6

###  Get Unique Values

In [31]:
unique_values = df['Column_A'].drop_duplicates()
unique_values

0      One
1      Two
2    Three
Name: Column_A, dtype: object

###  Split String into Columns Using Regex

In [32]:
df[['Part1', 'Part2']] = df['Combined'].str.extract(r'(\w+)_(\w+)')
df

,Column_A,Column_B,Combined,New_Column,Formatted,First_Part,Second_Part,Part1,Part2
0,One,2,1_2,Low,2.00,1,2,1,2
1,Two,4,2_4,High,4.00,2,4,2,4
2,Three,6,3_6,High,6.00,3,6,3,6

###  Frequency Counts

In [33]:
frequency_counts = df['Column_A'].value_counts()
frequency_counts

Column_A
One      1
Two      1
Three    1
Name: count, dtype: int64

###  Split Text Column

In [35]:
df[['Col1', 'Col2']] = df['Combined'].str.split('_', n=1, expand=True)
df

,Column_A,Column_B,Combined,New_Column,Formatted,First_Part,Second_Part,Part1,Part2,Col1,Col2
0,One,2,1_2,Low,2.00,1,2,1,2,1,2
1,Two,4,2_4,High,4.00,2,4,2,4,2,4
2,Three,6,3_6,High,6.00,3,6,3,6,3,6